# 1부터 n까지의 합을 구하여 출력하는 코드를 1) while 문 2) for 문으로 각각 작성하시오.
# sum() 함수 사용 금지

## for 문
n = int(input())
sum = 0
for i in range(1, n+1):
    sum += i
print(sum)

## while 문

# 1.
n = int(input())
i = 0
sum = 0
while i <= n:
    sum += i
    i += 1
print(sum)

# 0 <= 10
# 0 = 0 + 0 = 0
# 1 <= 10
# 0 = 0 + 1 = 1
# 2 <= 10
# 1 = 1 + 2 = 3
# 3 <= 10
# 3 = 3 + 3 = 6
# 4 <= 10
# 6 = 6 + 4 = 10
# 5 <= 10
# 10 = 10 + 5 = 15
# 6 <= 10
# 15 = 15 + 6 = 21
# 7 <= 10
# 21 = 21 + 7 = 28
# 8 <= 10
# 28 = 28 + 8 = 36
# 9 <= 10
# 36 = 36 + 9 = 45
# 10 <= 10
# 45 = 45 + 10 = 55

# 2.
n = int(input())
i = 0
sum = 0
while i < n:
    print(f'i: {i}, sum: {sum}')
    i += 1
    sum += i
print(sum)

# 0 < 10
# i: 0 = 0 + 1 = 1
# sum: 0 = 0 + 1 = 1
# 1 < 10
# i: 2
# sum: 1 = 1 + 2 = 3
# 2 < 10
# i: 3
# sum: 3 = 3 + 3 = 6
# 3 < 10
# i: 4
# sum: 6 = 6 + 4 = 10
# 4 < 10
# i: 5
# sum: 10 = 10 + 5 = 15
# 5 < 10
# i: 6
# sum: 15 = 15 + 6 = 21
# 6 < 10
# i: 7
# sum: 21 = 21 + 7 = 28
# 7 < 10
# i: 8
# sum: 28 = 28 + 8 = 36
# 8 < 10
# i: 9
# sum: 36 = 36 + 9 = 45
# 9 < 10
# i: 9 = 9 + 1 = 10
# sum: 45 = 45 + 10 = 55